devdnl/dnx-rtos/src/system/portable/stm32f1/stm32f10x_vectors.c
/*******************************************************************************
 * @author: Daniel Zorychta [danz@jabster.pl]
 *
 * Vector file for STM32F10x microcontroller series
 * compiler: arm-none-eabi-gcc
*******************************************************************************/

/** define weak assign to the default function */
#define WEAK_DEFAULT __attribute__ ((interrupt, weak, alias("__Default_Handler")))

/*============================================================================*/
/**
* \brief Default interrupt handler.
* \details Default interrupt handler, used for interrupts that don't have their
* own handler defined.
*/
/*============================================================================*/
static void __Default_Handler(void) __attribute__ ((interrupt));
static void __Default_Handler(void)
{
        while (1);
}

/*==============================================================================
Assign all unused interrupts to the default handler
==============================================================================*/
WEAK_DEFAULT void NMI_Handler(void);
WEAK_DEFAULT void HardFault_Handler(void);
WEAK_DEFAULT void MemManage_Handler(void);
WEAK_DEFAULT void BusFault_Handler(void);
WEAK_DEFAULT void UsageFault_Handler(void);
WEAK_DEFAULT void __Reserved_0x1C_IRQHandler(void);
WEAK_DEFAULT void __Reserved_0x20_IRQHandler(void);
WEAK_DEFAULT void __Reserved_0x24_IRQHandler(void);
WEAK_DEFAULT void __Reserved_0x28_IRQHandler(void);
WEAK_DEFAULT void SVC_Handler(void);
WEAK_DEFAULT void DebugMon_Handler(void);
WEAK_DEFAULT void __Reserved_0x34_IRQHandler(void);
WEAK_DEFAULT void PendSV_Handler(void);
WEAK_DEFAULT void SysTick_Handler(void);

/* STM32 specific Interrupt Numbers *******************************************/
WEAK_DEFAULT void WWDG_IRQHandler(void);
WEAK_DEFAULT void PVD_IRQHandler(void);
WEAK_DEFAULT void TAMPER_IRQHandler(void);
WEAK_DEFAULT void RTC_IRQHandler(void);
WEAK_DEFAULT void FLASH_IRQHandler(void);
WEAK_DEFAULT void RCC_IRQHandler(void);
WEAK_DEFAULT void EXTI0_IRQHandler(void);
WEAK_DEFAULT void EXTI1_IRQHandler(void);
WEAK_DEFAULT void EXTI2_IRQHandler(void);
WEAK_DEFAULT void EXTI3_IRQHandler(void);
WEAK_DEFAULT void EXTI4_IRQHandler(void);
WEAK_DEFAULT void DMA1_Channel1_IRQHandler(void);
WEAK_DEFAULT void DMA1_Channel2_IRQHandler(void);
WEAK_DEFAULT void DMA1_Channel3_IRQHandler(void);
WEAK_DEFAULT void DMA1_Channel4_IRQHandler(void);
WEAK_DEFAULT void DMA1_Channel5_IRQHandler(void);
WEAK_DEFAULT void DMA1_Channel6_IRQHandler(void);
WEAK_DEFAULT void DMA1_Channel7_IRQHandler(void);

#ifdef STM32F10X_LD
WEAK_DEFAULT void ADC1_2_IRQHandler(void);
WEAK_DEFAULT void USB_HP_CAN1_TX_IRQHandler(void);
WEAK_DEFAULT void USB_LP_CAN1_RX0_IRQHandler(void);
WEAK_DEFAULT void CAN1_RX1_IRQHandler(void);
WEAK_DEFAULT void CAN1_SCE_IRQHandler(void);
WEAK_DEFAULT void EXTI9_5_IRQHandler(void);
WEAK_DEFAULT void TIM1_BRK_IRQHandler(void);
WEAK_DEFAULT void TIM1_UP_IRQHandler(void);
WEAK_DEFAULT void TIM1_TRG_COM_IRQHandler(void);
WEAK_DEFAULT void TIM1_CC_IRQHandler(void);
WEAK_DEFAULT void TIM2_IRQHandler(void);
WEAK_DEFAULT void TIM3_IRQHandler(void);
WEAK_DEFAULT void __Reserved_30_IRQHandler(void);
WEAK_DEFAULT void I2C1_EV_IRQHandler(void);
WEAK_DEFAULT void I2C1_ER_IRQHandler(void);
WEAK_DEFAULT void __Reserved_33_IRQHandler(void);
WEAK_DEFAULT void __Reserved_34_IRQHandler(void);
WEAK_DEFAULT void SPI1_IRQHandler(void);
WEAK_DEFAULT void __Reserved_36_IRQHandler(void);
WEAK_DEFAULT void USART1_IRQHandler(void);
WEAK_DEFAULT void USART2_IRQHandler(void);
WEAK_DEFAULT void __Reserved_39_IRQHandler(void);
WEAK_DEFAULT void EXTI15_10_IRQHandler(void);
WEAK_DEFAULT void RTCAlarm_IRQHandler(void);
WEAK_DEFAULT void USBWakeUp_IRQHandler(void);
#endif /* STM32F10X_LD */

#ifdef STM32F10X_LD_VL
WEAK_DEFAULT void ADC1_IRQHandler(void);
WEAK_DEFAULT void __Reserved_19_IRQHandler(void);
WEAK_DEFAULT void __Reserved_20_IRQHandler(void);
WEAK_DEFAULT void __Reserved_21_IRQHandler(void);
WEAK_DEFAULT void __Reserved_22_IRQHandler(void);
WEAK_DEFAULT void EXTI9_5_IRQHandler(void);
WEAK_DEFAULT void TIM1_BRK_TIM15_IRQHandler(void);
WEAK_DEFAULT void TIM1_UP_TIM16_IRQHandler(void);
WEAK_DEFAULT void TIM1_TRG_COM_TIM17_IRQHandler(void);
WEAK_DEFAULT void TIM1_CC_IRQHandler(void);
WEAK_DEFAULT void TIM2_IRQHandler(void);
WEAK_DEFAULT void TIM3_IRQHandler(void);
WEAK_DEFAULT void __Reserved_30_IRQHandler(void);
WEAK_DEFAULT void I2C1_EV_IRQHandler(void);
WEAK_DEFAULT void I2C1_ER_IRQHandler(void);
WEAK_DEFAULT void __Reserved_33_IRQHandler(void);
WEAK_DEFAULT void __Reserved_34_IRQHandler(void);
WEAK_DEFAULT void SPI1_IRQHandler(void);
WEAK_DEFAULT void __Reserved_36_IRQHandler(void);
WEAK_DEFAULT void USART1_IRQHandler(void);
WEAK_DEFAULT void USART2_IRQHandler(void);
WEAK_DEFAULT void __Reserved_39_IRQHandler(void);
WEAK_DEFAULT void EXTI15_10_IRQHandler(void);
WEAK_DEFAULT void RTCAlarm_IRQHandler(void);
WEAK_DEFAULT void CEC_IRQHandler(void);
WEAK_DEFAULT void __Reserved_43_IRQHandler(void);
WEAK_DEFAULT void __Reserved_44_IRQHandler(void);
WEAK_DEFAULT void __Reserved_45_IRQHandler(void);
WEAK_DEFAULT void __Reserved_46_IRQHandler(void);
WEAK_DEFAULT void __Reserved_47_IRQHandler(void);
WEAK_DEFAULT void __Reserved_48_IRQHandler(void);
WEAK_DEFAULT void __Reserved_49_IRQHandler(void);
WEAK_DEFAULT void __Reserved_50_IRQHandler(void);
WEAK_DEFAULT void __Reserved_51_IRQHandler(void);
WEAK_DEFAULT void __Reserved_52_IRQHandler(void);
WEAK_DEFAULT void __Reserved_53_IRQHandler(void);
WEAK_DEFAULT void TIM6_DAC_IRQHandler(void);
WEAK_DEFAULT void TIM7_IRQHandler(void);
#endif /* STM32F10X_LD_VL */

#ifdef STM32F10X_MD
WEAK_DEFAULT void ADC1_2_IRQHandler(void);
WEAK_DEFAULT void USB_HP_CAN1_TX_IRQHandler(void);
WEAK_DEFAULT void USB_LP_CAN1_RX0_IRQHandler(void);
WEAK_DEFAULT void CAN1_RX1_IRQHandler(void);
WEAK_DEFAULT void CAN1_SCE_IRQHandler(void);
WEAK_DEFAULT void EXTI9_5_IRQHandler(void);
WEAK_DEFAULT void TIM1_BRK_IRQHandler(void);
WEAK_DEFAULT void TIM1_UP_IRQHandler(void);
WEAK_DEFAULT void TIM1_TRG_COM_IRQHandler(void);
WEAK_DEFAULT void TIM1_CC_IRQHandler(void);
WEAK_DEFAULT void TIM2_IRQHandler(void);
WEAK_DEFAULT void TIM3_IRQHandler(void);
WEAK_DEFAULT void TIM4_IRQHandler(void);
WEAK_DEFAULT void I2C1_EV_IRQHandler(void);
WEAK_DEFAULT void I2C1_ER_IRQHandler(void);
WEAK_DEFAULT void I2C2_EV_IRQHandler(void);
WEAK_DEFAULT void I2C2_ER_IRQHandler(void);
WEAK_DEFAULT void SPI1_IRQHandler(void);
WEAK_DEFAULT void SPI2_IRQHandler(void);
WEAK_DEFAULT void USART1_IRQHandler(void);
WEAK_DEFAULT void USART2_IRQHandler(void);
WEAK_DEFAULT void USART3_IRQHandler(void);
WEAK_DEFAULT void EXTI15_10_IRQHandler(void);
WEAK_DEFAULT void RTCAlarm_IRQHandler(void);
WEAK_DEFAULT void USBWakeUp_IRQHandler(void);
#endif /* STM32F10X_MD */

#ifdef STM32F10X_MD_VL
WEAK_DEFAULT void ADC1_IRQHandler(void);
WEAK_DEFAULT void __Reserved_19_IRQHandler(void);
WEAK_DEFAULT void __Reserved_20_IRQHandler(void);
WEAK_DEFAULT void __Reserved_21_IRQHandler(void);
WEAK_DEFAULT void __Reserved_22_IRQHandler(void);
WEAK_DEFAULT void EXTI9_5_IRQHandler(void);
WEAK_DEFAULT void TIM1_BRK_TIM15_IRQHandler(void);
WEAK_DEFAULT void TIM1_UP_TIM16_IRQHandler(void);
WEAK_DEFAULT void TIM1_TRG_COM_TIM17_IRQHandler(void);
WEAK_DEFAULT void TIM1_CC_IRQHandler(void);
WEAK_DEFAULT void TIM2_IRQHandler(void);
WEAK_DEFAULT void TIM3_IRQHandler(void);
WEAK_DEFAULT void TIM4_IRQHandler(void);
WEAK_DEFAULT void I2C1_EV_IRQHandler(void);
WEAK_DEFAULT void I2C1_ER_IRQHandler(void);
WEAK_DEFAULT void I2C2_EV_IRQHandler(void);
WEAK_DEFAULT void I2C2_ER_IRQHandler(void);
WEAK_DEFAULT void SPI1_IRQHandler(void);
WEAK_DEFAULT void SPI2_IRQHandler(void);
WEAK_DEFAULT void USART1_IRQHandler(void);
WEAK_DEFAULT void USART2_IRQHandler(void);
WEAK_DEFAULT void USART3_IRQHandler(void);
WEAK_DEFAULT void EXTI15_10_IRQHandler(void);
WEAK_DEFAULT void RTCAlarm_IRQHandler(void);
WEAK_DEFAULT void CEC_IRQHandler(void);
WEAK_DEFAULT void __Reserved_43_IRQHandler(void);
WEAK_DEFAULT void __Reserved_44_IRQHandler(void);
WEAK_DEFAULT void __Reserved_45_IRQHandler(void);
WEAK_DEFAULT void __Reserved_46_IRQHandler(void);
WEAK_DEFAULT void __Reserved_47_IRQHandler(void);
WEAK_DEFAULT void __Reserved_48_IRQHandler(void);
WEAK_DEFAULT void __Reserved_49_IRQHandler(void);
WEAK_DEFAULT void __Reserved_50_IRQHandler(void);
WEAK_DEFAULT void __Reserved_51_IRQHandler(void);
WEAK_DEFAULT void __Reserved_52_IRQHandler(void);
WEAK_DEFAULT void __Reserved_53_IRQHandler(void);
WEAK_DEFAULT void TIM6_DAC_IRQHandler(void);
WEAK_DEFAULT void TIM7_IRQHandler(void);
#endif /* STM32F10X_MD_VL */

#ifdef STM32F10X_HD
WEAK_DEFAULT void ADC1_2_IRQHandler(void);
WEAK_DEFAULT void USB_HP_CAN1_TX_IRQHandler(void);
WEAK_DEFAULT void USB_LP_CAN1_RX0_IRQHandler(void);
WEAK_DEFAULT void CAN1_RX1_IRQHandler(void);
WEAK_DEFAULT void CAN1_SCE_IRQHandler(void);
WEAK_DEFAULT void EXTI9_5_IRQHandler(void);
WEAK_DEFAULT void TIM1_BRK_IRQHandler(void);
WEAK_DEFAULT void TIM1_UP_IRQHandler(void);
WEAK_DEFAULT void TIM1_TRG_COM_IRQHandler(void);
WEAK_DEFAULT void TIM1_CC_IRQHandler(void);
WEAK_DEFAULT void TIM2_IRQHandler(void);
WEAK_DEFAULT void TIM3_IRQHandler(void);
WEAK_DEFAULT void TIM4_IRQHandler(void);
WEAK_DEFAULT void I2C1_EV_IRQHandler(void);
WEAK_DEFAULT void I2C1_ER_IRQHandler(void);
WEAK_DEFAULT void I2C2_EV_IRQHandler(void);
WEAK_DEFAULT void I2C2_ER_IRQHandler(void);
WEAK_DEFAULT void SPI1_IRQHandler(void);
WEAK_DEFAULT void SPI2_IRQHandler(void);
WEAK_DEFAULT void USART1_IRQHandler(void);
WEAK_DEFAULT void USART2_IRQHandler(void);
WEAK_DEFAULT void USART3_IRQHandler(void);
WEAK_DEFAULT void EXTI15_10_IRQHandler(void);
WEAK_DEFAULT void RTCAlarm_IRQHandler(void);
WEAK_DEFAULT void USBWakeUp_IRQHandler(void);
WEAK_DEFAULT void TIM8_BRK_IRQHandler(void);
WEAK_DEFAULT void TIM8_UP_IRQHandler(void);
WEAK_DEFAULT void TIM8_TRG_COM_IRQHandler(void);
WEAK_DEFAULT void TIM8_CC_IRQHandler(void);
WEAK_DEFAULT void ADC3_IRQHandler(void);
WEAK_DEFAULT void FSMC_IRQHandler(void);
WEAK_DEFAULT void SDIO_IRQHandler(void);
WEAK_DEFAULT void TIM5_IRQHandler(void);
WEAK_DEFAULT void SPI3_IRQHandler(void);
WEAK_DEFAULT void UART4_IRQHandler(void);
WEAK_DEFAULT void UART5_IRQHandler(void);
WEAK_DEFAULT void TIM6_IRQHandler(void);
WEAK_DEFAULT void TIM7_IRQHandler(void);
WEAK_DEFAULT void DMA2_Channel1_IRQHandler(void);
WEAK_DEFAULT void DMA2_Channel2_IRQHandler(void);
WEAK_DEFAULT void DMA2_Channel3_IRQHandler(void);
WEAK_DEFAULT void DMA2_Channel4_5_IRQHandler(void);
#endif /* STM32F10X_HD */

#ifdef STM32F10X_HD_VL
WEAK_DEFAULT void ADC1_IRQHandler(void);
WEAK_DEFAULT void __Reserved_19_IRQHandler(void);
WEAK_DEFAULT void __Reserved_20_IRQHandler(void);
WEAK_DEFAULT void __Reserved_21_IRQHandler(void);
WEAK_DEFAULT void __Reserved_22_IRQHandler(void);
WEAK_DEFAULT void EXTI9_5_IRQHandler(void);
WEAK_DEFAULT void TIM1_BRK_TIM15_IRQHandler(void);
WEAK_DEFAULT void TIM1_UP_TIM16_IRQHandler(void);
WEAK_DEFAULT void TIM1_TRG_COM_TIM17_IRQHandler(void);
WEAK_DEFAULT void TIM1_CC_IRQHandler(void);
WEAK_DEFAULT void TIM2_IRQHandler(void);
WEAK_DEFAULT void TIM3_IRQHandler(void);
WEAK_DEFAULT void TIM4_IRQHandler(void);
WEAK_DEFAULT void I2C1_EV_IRQHandler(void);
WEAK_DEFAULT void I2C1_ER_IRQHandler(void);
WEAK_DEFAULT void I2C2_EV_IRQHandler(void);
WEAK_DEFAULT void I2C2_ER_IRQHandler(void);
WEAK_DEFAULT void SPI1_IRQHandler(void);
WEAK_DEFAULT void SPI2_IRQHandler(void);
WEAK_DEFAULT void USART1_IRQHandler(void);
WEAK_DEFAULT void USART2_IRQHandler(void);
WEAK_DEFAULT void USART3_IRQHandler(void);
WEAK_DEFAULT void EXTI15_10_IRQHandler(void);
WEAK_DEFAULT void RTCAlarm_IRQHandler(void);
WEAK_DEFAULT void CEC_IRQHandler(void);
WEAK_DEFAULT void TIM12_IRQHandler(void);
WEAK_DEFAULT void TIM13_IRQHandler(void);
WEAK_DEFAULT void TIM14_IRQHandler(void);
WEAK_DEFAULT void __Reserved_46_IRQHandler(void);
WEAK_DEFAULT void __Reserved_47_IRQHandler(void);
WEAK_DEFAULT void __Reserved_48_IRQHandler(void);
WEAK_DEFAULT void __Reserved_49_IRQHandler(void);
WEAK_DEFAULT void TIM5_IRQHandler(void);
WEAK_DEFAULT void SPI3_IRQHandler(void);
WEAK_DEFAULT void UART4_IRQHandler(void);
WEAK_DEFAULT void UART5_IRQHandler(void);
WEAK_DEFAULT void TIM6_DAC_IRQHandler(void);
WEAK_DEFAULT void TIM7_IRQHandler(void);
WEAK_DEFAULT void DMA2_Channel1_IRQHandler(void);
WEAK_DEFAULT void DMA2_Channel2_IRQHandler(void);
WEAK_DEFAULT void DMA2_Channel3_IRQHandler(void);
WEAK_DEFAULT void DMA2_Channel4_5_IRQHandler(void);
WEAK_DEFAULT void DMA2_Channel5_IRQHandler(void);
#endif /* STM32F10X_HD_VL */

