devdnl/dnx-rtos/src/system/portable/stm32f1/stm32f10x_vectors.c
#ifdef STM32F10X_XL
WEAK_DEFAULT void ADC1_2_IRQHandler(void);
WEAK_DEFAULT void USB_HP_CAN1_TX_IRQHandler(void);
WEAK_DEFAULT void USB_LP_CAN1_RX0_IRQHandler(void);
WEAK_DEFAULT void CAN1_RX1_IRQHandler(void);
WEAK_DEFAULT void CAN1_SCE_IRQHandler(void);
WEAK_DEFAULT void EXTI9_5_IRQHandler(void);
WEAK_DEFAULT void TIM1_BRK_TIM9_IRQHandler(void);
WEAK_DEFAULT void TIM1_UP_TIM10_IRQHandler(void);
WEAK_DEFAULT void TIM1_TRG_COM_TIM11_IRQHandler(void);
WEAK_DEFAULT void TIM1_CC_IRQHandler(void);
WEAK_DEFAULT void TIM2_IRQHandler(void);
WEAK_DEFAULT void TIM3_IRQHandler(void);
WEAK_DEFAULT void TIM4_IRQHandler(void);
WEAK_DEFAULT void I2C1_EV_IRQHandler(void);
WEAK_DEFAULT void I2C1_ER_IRQHandler(void);
WEAK_DEFAULT void I2C2_EV_IRQHandler(void);
WEAK_DEFAULT void I2C2_ER_IRQHandler(void);
WEAK_DEFAULT void SPI1_IRQHandler(void);
WEAK_DEFAULT void SPI2_IRQHandler(void);
WEAK_DEFAULT void USART1_IRQHandler(void);
WEAK_DEFAULT void USART2_IRQHandler(void);
WEAK_DEFAULT void USART3_IRQHandler(void);
WEAK_DEFAULT void EXTI15_10_IRQHandler(void);
WEAK_DEFAULT void RTCAlarm_IRQHandler(void);
WEAK_DEFAULT void USBWakeUp_IRQHandler(void);
WEAK_DEFAULT void TIM8_BRK_TIM12_IRQHandler(void);
WEAK_DEFAULT void TIM8_UP_TIM13_IRQHandler(void);
WEAK_DEFAULT void TIM8_TRG_COM_TIM14_IRQHandler(void);
WEAK_DEFAULT void TIM8_CC_IRQHandler(void);
WEAK_DEFAULT void ADC3_IRQHandler(void);
WEAK_DEFAULT void FSMC_IRQHandler(void);
WEAK_DEFAULT void SDIO_IRQHandler(void);
WEAK_DEFAULT void TIM5_IRQHandler(void);
WEAK_DEFAULT void SPI3_IRQHandler(void);
WEAK_DEFAULT void UART4_IRQHandler(void);
WEAK_DEFAULT void UART5_IRQHandler(void);
WEAK_DEFAULT void TIM6_IRQHandler(void);
WEAK_DEFAULT void TIM7_IRQHandler(void);
WEAK_DEFAULT void DMA2_Channel1_IRQHandler(void);
WEAK_DEFAULT void DMA2_Channel2_IRQHandler(void);
WEAK_DEFAULT void DMA2_Channel3_IRQHandler(void);
WEAK_DEFAULT void DMA2_Channel4_5_IRQHandler(void);
#endif /* STM32F10X_XL */

#ifdef STM32F10X_CL
WEAK_DEFAULT void ADC1_2_IRQHandler(void);
WEAK_DEFAULT void CAN1_TX_IRQHandler(void);
WEAK_DEFAULT void CAN1_RX0_IRQHandler(void);
WEAK_DEFAULT void CAN1_RX1_IRQHandler(void);
WEAK_DEFAULT void CAN1_SCE_IRQHandler(void);
WEAK_DEFAULT void EXTI9_5_IRQHandler(void);
WEAK_DEFAULT void TIM1_BRK_IRQHandler(void);
WEAK_DEFAULT void TIM1_UP_IRQHandler(void);
WEAK_DEFAULT void TIM1_TRG_COM_IRQHandler(void);
WEAK_DEFAULT void TIM1_CC_IRQHandler(void);
WEAK_DEFAULT void TIM2_IRQHandler(void);
WEAK_DEFAULT void TIM3_IRQHandler(void);
WEAK_DEFAULT void TIM4_IRQHandler(void);
WEAK_DEFAULT void I2C1_EV_IRQHandler(void);
WEAK_DEFAULT void I2C1_ER_IRQHandler(void);
WEAK_DEFAULT void I2C2_EV_IRQHandler(void);
WEAK_DEFAULT void I2C2_ER_IRQHandler(void);
WEAK_DEFAULT void SPI1_IRQHandler(void);
WEAK_DEFAULT void SPI2_IRQHandler(void);
WEAK_DEFAULT void USART1_IRQHandler(void);
WEAK_DEFAULT void USART2_IRQHandler(void);
WEAK_DEFAULT void USART3_IRQHandler(void);
WEAK_DEFAULT void EXTI15_10_IRQHandler(void);
WEAK_DEFAULT void RTCAlarm_IRQHandler(void);
WEAK_DEFAULT void OTG_FS_WKUP_IRQHandler(void);
WEAK_DEFAULT void __Reserved_43_IRQHandler(void);
WEAK_DEFAULT void __Reserved_44_IRQHandler(void);
WEAK_DEFAULT void __Reserved_45_IRQHandler(void);
WEAK_DEFAULT void __Reserved_46_IRQHandler(void);
WEAK_DEFAULT void __Reserved_47_IRQHandler(void);
WEAK_DEFAULT void __Reserved_48_IRQHandler(void);
WEAK_DEFAULT void __Reserved_49_IRQHandler(void);
WEAK_DEFAULT void TIM5_IRQHandler(void);
WEAK_DEFAULT void SPI3_IRQHandler(void);
WEAK_DEFAULT void UART4_IRQHandler(void);
WEAK_DEFAULT void UART5_IRQHandler(void);
WEAK_DEFAULT void TIM6_IRQHandler(void);
WEAK_DEFAULT void TIM7_IRQHandler(void);
WEAK_DEFAULT void DMA2_Channel1_IRQHandler(void);
WEAK_DEFAULT void DMA2_Channel2_IRQHandler(void);
WEAK_DEFAULT void DMA2_Channel3_IRQHandler(void);
WEAK_DEFAULT void DMA2_Channel4_IRQHandler(void);
WEAK_DEFAULT void DMA2_Channel5_IRQHandler(void);
WEAK_DEFAULT void ETH_IRQHandler(void);
WEAK_DEFAULT void ETH_WKUP_IRQHandler(void);
WEAK_DEFAULT void CAN2_TX_IRQHandler(void);
WEAK_DEFAULT void CAN2_RX0_IRQHandler(void);
WEAK_DEFAULT void CAN2_RX1_IRQHandler(void);
WEAK_DEFAULT void CAN2_SCE_IRQHandler(void);
WEAK_DEFAULT void OTG_FS_IRQHandler(void);
#endif /* STM32F10X_CL */

/*==================================================================================================
Vector table
==================================================================================================*/
extern const char __main_stack_end;          /* imported main stack end (from linker script)      */

void Reset_Handler(void);                    /* import the address of Reset_Handler()             */

void (*const vectors[])(void) __attribute__ ((section(".vectors"))) =
{
   (void (*)(void))&__main_stack_end,        /* Main stack end address                            */
   Reset_Handler,                            /* Reset                                             */
   NMI_Handler,                              /* Non-maskable interrupt (RCC clock security system)*/
   HardFault_Handler,                        /* All class of fault                                */
   MemManage_Handler,                        /* Memory management                                 */
   BusFault_Handler,                         /* Pre-fetch fault, memory access fault              */
   UsageFault_Handler,                       /* Undefined instruction or illegal state            */
   __Reserved_0x1C_IRQHandler,
   __Reserved_0x20_IRQHandler,
   __Reserved_0x24_IRQHandler,
   __Reserved_0x28_IRQHandler,
   SVC_Handler,                              /* System service call via SWI instruction           */
   DebugMon_Handler,                         /* Debug monitor                                     */
   __Reserved_0x34_IRQHandler,
   PendSV_Handler,                           /* Pendable request for system service               */
   SysTick_Handler,                          /* System tick timer                                 */

   /* STM32 specific Interrupt Numbers ************************************************************/
   WWDG_IRQHandler,                          /* Window watchdog interrupt                         */
   PVD_IRQHandler,                           /* PVD through EXTI line detection interrupt         */
   TAMPER_IRQHandler,                        /* Tamper interrupt                                  */
   RTC_IRQHandler,                           /* RTC global interrupt                              */
   FLASH_IRQHandler,                         /* Flash global interrupt                            */
   RCC_IRQHandler,                           /* RCC global interrupt                              */
   EXTI0_IRQHandler,                         /* EXTI Line0 interrupt                              */
   EXTI1_IRQHandler,                         /* EXTI Line1 interrupt                              */
   EXTI2_IRQHandler,                         /* EXTI Line2 interrupt                              */
   EXTI3_IRQHandler,                         /* EXTI Line3 interrupt                              */
   EXTI4_IRQHandler,                         /* EXTI Line4 interrupt                              */
   DMA1_Channel1_IRQHandler,                 /* DMA1 Channel1 global interrupt                    */
   DMA1_Channel2_IRQHandler,                 /* DMA1 Channel2 global interrupt                    */
   DMA1_Channel3_IRQHandler,                 /* DMA1 Channel3 global interrupt                    */
   DMA1_Channel4_IRQHandler,                 /* DMA1 Channel4 global interrupt                    */
   DMA1_Channel5_IRQHandler,                 /* DMA1 Channel5 global interrupt                    */
   DMA1_Channel6_IRQHandler,                 /* DMA1 Channel6 global interrupt                    */
   DMA1_Channel7_IRQHandler,                 /* DMA1 Channel7 global interrupt                    */

#ifdef STM32F10X_LD
   ADC1_2_IRQHandler,                        /* ADC1 and ADC2 global Interrupt                    */
   USB_HP_CAN1_TX_IRQHandler,                /* USB Device High Priority or CAN1 TX Interrupts    */
   USB_LP_CAN1_RX0_IRQHandler,               /* USB Device Low Priority or CAN1 RX0 Interrupts    */
   CAN1_RX1_IRQHandler,                      /* CAN1 RX1 Interrupt                                */
   CAN1_SCE_IRQHandler,                      /* CAN1 SCE Interrupt                                */
   EXTI9_5_IRQHandler,                       /* External Line[9:5] Interrupts                     */
   TIM1_BRK_IRQHandler,                      /* TIM1 Break Interrupt                              */
   TIM1_UP_IRQHandler,                       /* TIM1 Update Interrupt                             */
   TIM1_TRG_COM_IRQHandler,                  /* TIM1 Trigger and Commutation Interrupt            */
   TIM1_CC_IRQHandler,                       /* TIM1 Capture Compare Interrupt                    */
   TIM2_IRQHandler,                          /* TIM2 global Interrupt                             */
   TIM3_IRQHandler,                          /* TIM3 global Interrupt                             */
   __Reserved_30_IRQHandler,
   I2C1_EV_IRQHandler,                       /* I2C1 Event Interrupt                              */
   I2C1_ER_IRQHandler,                       /* I2C1 Error Interrupt                              */
   __Reserved_33_IRQHandler,
   __Reserved_34_IRQHandler,
   SPI1_IRQHandler,                          /* SPI1 global Interrupt                             */
   __Reserved_36_IRQHandler,
   USART1_IRQHandler,                        /* USART1 global Interrupt                           */
   USART2_IRQHandler,                        /* USART2 global Interrupt                           */
   __Reserved_39_IRQHandler,
   EXTI15_10_IRQHandler,                     /* External Line[15:10] Interrupts                   */
   RTCAlarm_IRQHandler,                      /* RTC Alarm through EXTI Line Interrupt             */
   USBWakeUp_IRQHandler                      /* USB Device WakeUp from suspend through EXTI Line  */
#endif /* STM32F10X_LD */

#ifdef STM32F10X_LD_VL
   ADC1_IRQHandler,                         /* ADC1 global Interrupt                              */
   __Reserved_19_IRQHandler,
   __Reserved_20_IRQHandler,
   __Reserved_21_IRQHandler,
   __Reserved_22_IRQHandler,
   EXTI9_5_IRQHandler,                      /* External Line[9:5] Interrupts                      */
   TIM1_BRK_TIM15_IRQHandler,               /* TIM1 Break Interrupt                               */
   TIM1_UP_TIM16_IRQHandler,                /* TIM1 Update Interrupt                              */
   TIM1_TRG_COM_TIM17_IRQHandler,           /* TIM1 Trigger and Commutation Interrupt             */
   TIM1_CC_IRQHandler,                      /* TIM1 Capture Compare Interrupt                     */
   TIM2_IRQHandler,                         /* TIM2 global Interrupt                              */
   TIM3_IRQHandler,                         /* TIM3 global Interrupt                              */
   __Reserved_30_IRQHandler,
   I2C1_EV_IRQHandler,                      /* I2C1 Event Interrupt                               */
   I2C1_ER_IRQHandler,                      /* I2C1 Error Interrupt                               */
   __Reserved_33_IRQHandler,
   __Reserved_34_IRQHandler,
   SPI1_IRQHandler,                         /* SPI1 global Interrupt                              */
   __Reserved_36_IRQHandler,
   USART1_IRQHandler,                       /* USART1 global Interrupt                            */
   USART2_IRQHandler,                       /* USART2 global Interrupt                            */
   __Reserved_39_IRQHandler,
   EXTI15_10_IRQHandler,                    /* External Line[15:10] Interrupts                    */
   RTCAlarm_IRQHandler,                     /* RTC Alarm through EXTI Line Interrupt              */
   CEC_IRQHandler,                          /* CEC global interrupt                               */
   __Reserved_43_IRQHandler,
   __Reserved_44_IRQHandler,
   __Reserved_45_IRQHandler,
   __Reserved_46_IRQHandler,
   __Reserved_47_IRQHandler,
   __Reserved_48_IRQHandler,
   __Reserved_49_IRQHandler,
   __Reserved_50_IRQHandler,
   __Reserved_51_IRQHandler,
   __Reserved_52_IRQHandler,
   __Reserved_53_IRQHandler,
   TIM6_DAC_IRQHandler,                     /* TIM6 and DAC underrun Interrupt                    */
   TIM7_IRQHandler                          /* TIM7 Interrupt                                     */
#endif /* STM32F10X_LD_VL */

#ifdef STM32F10X_MD
   ADC1_2_IRQHandler,                       /* ADC1 and ADC2 global Interrupt                     */
   USB_HP_CAN1_TX_IRQHandler,               /* USB Device High Priority or CAN1 TX Interrupts     */
   USB_LP_CAN1_RX0_IRQHandler,              /* USB Device Low Priority or CAN1 RX0 Interrupts     */
   CAN1_RX1_IRQHandler,                     /* CAN1 RX1 Interrupt                                 */
   CAN1_SCE_IRQHandler,                     /* CAN1 SCE Interrupt                                 */
   EXTI9_5_IRQHandler,                      /* External Line[9:5] Interrupts                      */
   TIM1_BRK_IRQHandler,                     /* TIM1 Break Interrupt                               */
   TIM1_UP_IRQHandler,                      /* TIM1 Update Interrupt                              */
   TIM1_TRG_COM_IRQHandler,                 /* TIM1 Trigger and Commutation Interrupt             */
   TIM1_CC_IRQHandler,                      /* TIM1 Capture Compare Interrupt                     */
   TIM2_IRQHandler,                         /* TIM2 global Interrupt                              */
   TIM3_IRQHandler,                         /* TIM3 global Interrupt                              */
   TIM4_IRQHandler,                         /* TIM4 global Interrupt                              */
   I2C1_EV_IRQHandler,                      /* I2C1 Event Interrupt                               */
   I2C1_ER_IRQHandler,                      /* I2C1 Error Interrupt                               */
   I2C2_EV_IRQHandler,                      /* I2C2 Event Interrupt                               */
   I2C2_ER_IRQHandler,                      /* I2C2 Error Interrupt                               */
   SPI1_IRQHandler,                         /* SPI1 global Interrupt                              */
   SPI2_IRQHandler,                         /* SPI2 global Interrupt                              */
   USART1_IRQHandler,                       /* USART1 global Interrupt                            */
   USART2_IRQHandler,                       /* USART2 global Interrupt                            */
   USART3_IRQHandler,                       /* USART3 global Interrupt                            */
   EXTI15_10_IRQHandler,                    /* External Line[15:10] Interrupts                    */
   RTCAlarm_IRQHandler,                     /* RTC Alarm through EXTI Line Interrupt              */
   USBWakeUp_IRQHandler                     /* USB Device WakeUp from suspend through EXTI Line   */
#endif /* STM32F10X_MD */

#ifdef STM32F10X_MD_VL
   ADC1_IRQHandler,                         /* ADC1 global Interrupt                              */
   __Reserved_19_IRQHandler,
   __Reserved_20_IRQHandler,
   __Reserved_21_IRQHandler,
   __Reserved_22_IRQHandler,
   EXTI9_5_IRQHandler,                      /* External Line[9:5] Interrupts                      */
   TIM1_BRK_TIM15_IRQHandler,               /* TIM1 Break and TIM15 Interrupts                    */
   TIM1_UP_TIM16_IRQHandler,                /* TIM1 Update and TIM16 Interrupts                   */
   TIM1_TRG_COM_TIM17_IRQHandler,           /* TIM1 Trigger and Commutation and TIM17 Interrupt   */
   TIM1_CC_IRQHandler,                      /* TIM1 Capture Compare Interrupt                     */
   TIM2_IRQHandler,                         /* TIM2 global Interrupt                              */
   TIM3_IRQHandler,                         /* TIM3 global Interrupt                              */
   TIM4_IRQHandler,                         /* TIM4 global Interrupt                              */
   I2C1_EV_IRQHandler,                      /* I2C1 Event Interrupt                               */
   I2C1_ER_IRQHandler,                      /* I2C1 Error Interrupt                               */
   I2C2_EV_IRQHandler,                      /* I2C2 Event Interrupt                               */
   I2C2_ER_IRQHandler,                      /* I2C2 Error Interrupt                               */
   SPI1_IRQHandler,                         /* SPI1 global Interrupt                              */
   SPI2_IRQHandler,                         /* SPI2 global Interrupt                              */
   USART1_IRQHandler,                       /* USART1 global Interrupt                            */
   USART2_IRQHandler,                       /* USART2 global Interrupt                            */
   USART3_IRQHandler,                       /* USART3 global Interrupt                            */
   EXTI15_10_IRQHandler,                    /* External Line[15:10] Interrupts                    */
   RTCAlarm_IRQHandler,                     /* RTC Alarm through EXTI Line Interrupt              */
   CEC_IRQHandler,                          /* HDMI-CEC Interrupt                                 */
   __Reserved_43_IRQHandler,
   __Reserved_44_IRQHandler,
   __Reserved_45_IRQHandler,
   __Reserved_46_IRQHandler,
   __Reserved_47_IRQHandler,
   __Reserved_48_IRQHandler,
   __Reserved_49_IRQHandler,
   __Reserved_50_IRQHandler,
   __Reserved_51_IRQHandler,
   __Reserved_52_IRQHandler,
   __Reserved_53_IRQHandler,
   TIM6_DAC_IRQHandler,                     /* TIM6 and DAC underrun Interrupt                    */
   TIM7_IRQHandler                          /* TIM7 Interrupt                                     */
#endif /* STM32F10X_MD_VL */

#ifdef STM32F10X_HD
   ADC1_2_IRQHandler,                       /* ADC1 and ADC2 global Interrupt                     */
   USB_HP_CAN1_TX_IRQHandler,               /* USB Device High Priority or CAN1 TX Interrupts     */
   USB_LP_CAN1_RX0_IRQHandler,              /* USB Device Low Priority or CAN1 RX0 Interrupts     */
   CAN1_RX1_IRQHandler,                     /* CAN1 RX1 Interrupt                                 */
   CAN1_SCE_IRQHandler,                     /* CAN1 SCE Interrupt                                 */
   EXTI9_5_IRQHandler,                      /* External Line[9:5] Interrupts                      */
   TIM1_BRK_IRQHandler,                     /* TIM1 Break Interrupt                               */
   TIM1_UP_IRQHandler,                      /* TIM1 Update Interrupt                              */
   TIM1_TRG_COM_IRQHandler,                 /* TIM1 Trigger and Commutation Interrupt             */
   TIM1_CC_IRQHandler,                      /* TIM1 Capture Compare Interrupt                     */
   TIM2_IRQHandler,                         /* TIM2 global Interrupt                              */
   TIM3_IRQHandler,                         /* TIM3 global Interrupt                              */
   TIM4_IRQHandler,                         /* TIM4 global Interrupt                              */
   I2C1_EV_IRQHandler,                      /* I2C1 Event Interrupt                               */
   I2C1_ER_IRQHandler,                      /* I2C1 Error Interrupt                               */
   I2C2_EV_IRQHandler,                      /* I2C2 Event Interrupt                               */
   I2C2_ER_IRQHandler,                      /* I2C2 Error Interrupt                               */
   SPI1_IRQHandler,                         /* SPI1 global Interrupt                              */
   SPI2_IRQHandler,                         /* SPI2 global Interrupt                              */
   USART1_IRQHandler,                       /* USART1 global Interrupt                            */
   USART2_IRQHandler,                       /* USART2 global Interrupt                            */
   USART3_IRQHandler,                       /* USART3 global Interrupt                            */
   EXTI15_10_IRQHandler,                    /* External Line[15:10] Interrupts                    */
   RTCAlarm_IRQHandler,                     /* RTC Alarm through EXTI Line Interrupt              */
   USBWakeUp_IRQHandler,                    /* USB Device WakeUp from suspend through EXTI Line   */
   TIM8_BRK_IRQHandler,                     /* TIM8 Break Interrupt                               */
   TIM8_UP_IRQHandler,                      /* TIM8 Update Interrupt                              */
   TIM8_TRG_COM_IRQHandler,                 /* TIM8 Trigger and Commutation Interrupt             */
   TIM8_CC_IRQHandler,                      /* TIM8 Capture Compare Interrupt                     */
   ADC3_IRQHandler,                         /* ADC3 global Interrupt                              */
   FSMC_IRQHandler,                         /* FSMC global Interrupt                              */
   SDIO_IRQHandler,                         /* SDIO global Interrupt                              */
   TIM5_IRQHandler,                         /* TIM5 global Interrupt                              */
   SPI3_IRQHandler,                         /* SPI3 global Interrupt                              */
   UART4_IRQHandler,                        /* UART4 global Interrupt                             */
   UART5_IRQHandler,                        /* UART5 global Interrupt                             */
   TIM6_IRQHandler,                         /* TIM6 global Interrupt                              */
   TIM7_IRQHandler,                         /* TIM7 global Interrupt                              */
   DMA2_Channel1_IRQHandler,                /* DMA2 Channel 1 global Interrupt                    */
   DMA2_Channel2_IRQHandler,                /* DMA2 Channel 2 global Interrupt                    */
   DMA2_Channel3_IRQHandler,                /* DMA2 Channel 3 global Interrupt                    */
   DMA2_Channel4_5_IRQHandler               /* DMA2 Channel 4 and Channel 5 global Interrupt      */
#endif /* STM32F10X_HD */

