devdnl/dnx-rtos/src/system/portable/stm32f1/stm32f10x_vectors.c
#ifdef STM32F10X_HD_VL
   ADC1_IRQHandler,                         /* ADC1 global Interrupt                              */
   __Reserved_19_IRQHandler,
   __Reserved_20_IRQHandler,
   __Reserved_21_IRQHandler,
   __Reserved_22_IRQHandler,
   EXTI9_5_IRQHandler,                      /* External Line[9:5] Interrupts                      */
   TIM1_BRK_TIM15_IRQHandler,               /* TIM1 Break and TIM15 Interrupts                    */
   TIM1_UP_TIM16_IRQHandler,                /* TIM1 Update and TIM16 Interrupts                   */
   TIM1_TRG_COM_TIM17_IRQHandler,           /* TIM1 Trigger and Commutation and TIM17 Interrupt   */
   TIM1_CC_IRQHandler,                      /* TIM1 Capture Compare Interrupt                     */
   TIM2_IRQHandler,                         /* TIM2 global Interrupt                              */
   TIM3_IRQHandler,                         /* TIM3 global Interrupt                              */
   TIM4_IRQHandler,                         /* TIM4 global Interrupt                              */
   I2C1_EV_IRQHandler,                      /* I2C1 Event Interrupt                               */
   I2C1_ER_IRQHandler,                      /* I2C1 Error Interrupt                               */
   I2C2_EV_IRQHandler,                      /* I2C2 Event Interrupt                               */
   I2C2_ER_IRQHandler,                      /* I2C2 Error Interrupt                               */
   SPI1_IRQHandler,                         /* SPI1 global Interrupt                              */
   SPI2_IRQHandler,                         /* SPI2 global Interrupt                              */
   USART1_IRQHandler,                       /* USART1 global Interrupt                            */
   USART2_IRQHandler,                       /* USART2 global Interrupt                            */
   USART3_IRQHandler,                       /* USART3 global Interrupt                            */
   EXTI15_10_IRQHandler,                    /* External Line[15:10] Interrupts                    */
   RTCAlarm_IRQHandler,                     /* RTC Alarm through EXTI Line Interrupt              */
   CEC_IRQHandler,                          /* HDMI-CEC Interrupt                                 */
   TIM12_IRQHandler,                        /* TIM12 global Interrupt                             */
   TIM13_IRQHandler,                        /* TIM13 global Interrupt                             */
   TIM14_IRQHandler,                        /* TIM14 global Interrupt                             */
   __Reserved_46_IRQHandler,
   __Reserved_47_IRQHandler,
   __Reserved_48_IRQHandler,
   __Reserved_49_IRQHandler,
   TIM5_IRQHandler,                         /* TIM5 global Interrupt                              */
   SPI3_IRQHandler,                         /* SPI3 global Interrupt                              */
   UART4_IRQHandler,                        /* UART4 global Interrupt                             */
   UART5_IRQHandler,                        /* UART5 global Interrupt                             */
   TIM6_DAC_IRQHandler,                     /* TIM6 and DAC underrun Interrupt                    */
   TIM7_IRQHandler,                         /* TIM7 Interrupt                                     */
   DMA2_Channel1_IRQHandler,                /* DMA2 Channel 1 global Interrupt                    */
   DMA2_Channel2_IRQHandler,                /* DMA2 Channel 2 global Interrupt                    */
   DMA2_Channel3_IRQHandler,                /* DMA2 Channel 3 global Interrupt                    */
   DMA2_Channel4_5_IRQHandler,              /* DMA2 Channel 4 and Channel 5 global Interrupt      */
   DMA2_Channel5_IRQHandler                 /* DMA2 Channel 5 global Interrupt (DMA2 Channel 5
                                               mapped at position 60 only if the MISC_REMAP bit in
                                               the AFIO_MAPR2 register is set)                    */
#endif /* STM32F10X_HD_VL */

#ifdef STM32F10X_XL
   ADC1_2_IRQHandler,                       /* ADC1 and ADC2 global Interrupt                     */
   USB_HP_CAN1_TX_IRQHandler,               /* USB Device High Priority or CAN1 TX Interrupts     */
   USB_LP_CAN1_RX0_IRQHandler,              /* USB Device Low Priority or CAN1 RX0 Interrupts     */
   CAN1_RX1_IRQHandler,                     /* CAN1 RX1 Interrupt                                 */
   CAN1_SCE_IRQHandler,                     /* CAN1 SCE Interrupt                                 */
   EXTI9_5_IRQHandler,                      /* External Line[9:5] Interrupts                      */
   TIM1_BRK_TIM9_IRQHandler,                /* TIM1 Break Interrupt and TIM9 global Interrupt     */
   TIM1_UP_TIM10_IRQHandler,                /* TIM1 Update Interrupt and TIM10 global Interrupt   */
   TIM1_TRG_COM_TIM11_IRQHandler,           /* TIM1 Trigger and Commutation Interrupt and TIM11   */
   TIM1_CC_IRQHandler,                      /* TIM1 Capture Compare Interrupt                     */
   TIM2_IRQHandler,                         /* TIM2 global Interrupt                              */
   TIM3_IRQHandler,                         /* TIM3 global Interrupt                              */
   TIM4_IRQHandler,                         /* TIM4 global Interrupt                              */
   I2C1_EV_IRQHandler,                      /* I2C1 Event Interrupt                               */
   I2C1_ER_IRQHandler,                      /* I2C1 Error Interrupt                               */
   I2C2_EV_IRQHandler,                      /* I2C2 Event Interrupt                               */
   I2C2_ER_IRQHandler,                      /* I2C2 Error Interrupt                               */
   SPI1_IRQHandler,                         /* SPI1 global Interrupt                              */
   SPI2_IRQHandler,                         /* SPI2 global Interrupt                              */
   USART1_IRQHandler,                       /* USART1 global Interrupt                            */
   USART2_IRQHandler,                       /* USART2 global Interrupt                            */
   USART3_IRQHandler,                       /* USART3 global Interrupt                            */
   EXTI15_10_IRQHandler,                    /* External Line[15:10] Interrupts                    */
   RTCAlarm_IRQHandler,                     /* RTC Alarm through EXTI Line Interrupt              */
   USBWakeUp_IRQHandler,                    /* USB Device WakeUp from suspend through EXTI Line   */
   TIM8_BRK_TIM12_IRQHandler,               /* TIM8 Break Interrupt and TIM12 global Interrupt    */
   TIM8_UP_TIM13_IRQHandler,                /* TIM8 Update Interrupt and TIM13 global Interrupt   */
   TIM8_TRG_COM_TIM14_IRQHandler,           /* TIM8 Trigger and Commutation Interrupt and TIM14   */
   TIM8_CC_IRQHandler,                      /* TIM8 Capture Compare Interrupt                     */
   ADC3_IRQHandler,                         /* ADC3 global Interrupt                              */
   FSMC_IRQHandler,                         /* FSMC global Interrupt                              */
   SDIO_IRQHandler,                         /* SDIO global Interrupt                              */
   TIM5_IRQHandler,                         /* TIM5 global Interrupt                              */
   SPI3_IRQHandler,                         /* SPI3 global Interrupt                              */
   UART4_IRQHandler,                        /* UART4 global Interrupt                             */
   UART5_IRQHandler,                        /* UART5 global Interrupt                             */
   TIM6_IRQHandler,                         /* TIM6 global Interrupt                              */
   TIM7_IRQHandler,                         /* TIM7 global Interrupt                              */
   DMA2_Channel1_IRQHandler,                /* DMA2 Channel 1 global Interrupt                    */
   DMA2_Channel2_IRQHandler,                /* DMA2 Channel 2 global Interrupt                    */
   DMA2_Channel3_IRQHandler,                /* DMA2 Channel 3 global Interrupt                    */
   DMA2_Channel4_5_IRQHandler               /* DMA2 Channel 4 and Channel 5 global Interrupt      */
#endif /* STM32F10X_XL */

#ifdef STM32F10X_CL
   ADC1_2_IRQHandler,                       /* ADC1 and ADC2 global Interrupt                     */
   CAN1_TX_IRQHandler,                      /* USB Device High Priority or CAN1 TX Interrupts     */
   CAN1_RX0_IRQHandler,                     /* USB Device Low Priority or CAN1 RX0 Interrupts     */
   CAN1_RX1_IRQHandler,                     /* CAN1 RX1 Interrupt                                 */
   CAN1_SCE_IRQHandler,                     /* CAN1 SCE Interrupt                                 */
   EXTI9_5_IRQHandler,                      /* External Line[9:5] Interrupts                      */
   TIM1_BRK_IRQHandler,                     /* TIM1 Break Interrupt                               */
   TIM1_UP_IRQHandler,                      /* TIM1 Update Interrupt                              */
   TIM1_TRG_COM_IRQHandler,                 /* TIM1 Trigger and Commutation Interrupt             */
   TIM1_CC_IRQHandler,                      /* TIM1 Capture Compare Interrupt                     */
   TIM2_IRQHandler,                         /* TIM2 global Interrupt                              */
   TIM3_IRQHandler,                         /* TIM3 global Interrupt                              */
   TIM4_IRQHandler,                         /* TIM4 global Interrupt                              */
   I2C1_EV_IRQHandler,                      /* I2C1 Event Interrupt                               */
   I2C1_ER_IRQHandler,                      /* I2C1 Error Interrupt                               */
   I2C2_EV_IRQHandler,                      /* I2C2 Event Interrupt                               */
   I2C2_ER_IRQHandler,                      /* I2C2 Error Interrupt                               */
   SPI1_IRQHandler,                         /* SPI1 global Interrupt                              */
   SPI2_IRQHandler,                         /* SPI2 global Interrupt                              */
   USART1_IRQHandler,                       /* USART1 global Interrupt                            */
   USART2_IRQHandler,                       /* USART2 global Interrupt                            */
   USART3_IRQHandler,                       /* USART3 global Interrupt                            */
   EXTI15_10_IRQHandler,                    /* External Line[15:10] Interrupts                    */
   RTCAlarm_IRQHandler,                     /* RTC Alarm through EXTI Line Interrupt              */
   OTG_FS_WKUP_IRQHandler,                  /* USB OTG FS WakeUp from suspend through EXTI Line   */
   __Reserved_43_IRQHandler,
   __Reserved_44_IRQHandler,
   __Reserved_45_IRQHandler,
   __Reserved_46_IRQHandler,
   __Reserved_47_IRQHandler,
   __Reserved_48_IRQHandler,
   __Reserved_49_IRQHandler,
   TIM5_IRQHandler,                         /* TIM5 global Interrupt                              */
   SPI3_IRQHandler,                         /* SPI3 global Interrupt                              */
   UART4_IRQHandler,                        /* UART4 global Interrupt                             */
   UART5_IRQHandler,                        /* UART5 global Interrupt                             */
   TIM6_IRQHandler,                         /* TIM6 global Interrupt                              */
   TIM7_IRQHandler,                         /* TIM7 global Interrupt                              */
   DMA2_Channel1_IRQHandler,                /* DMA2 Channel 1 global Interrupt                    */
   DMA2_Channel2_IRQHandler,                /* DMA2 Channel 2 global Interrupt                    */
   DMA2_Channel3_IRQHandler,                /* DMA2 Channel 3 global Interrupt                    */
   DMA2_Channel4_IRQHandler,                /* DMA2 Channel 4 global Interrupt                    */
   DMA2_Channel5_IRQHandler,                /* DMA2 Channel 5 global Interrupt                    */
   ETH_IRQHandler,                          /* Ethernet global Interrupt                          */
   ETH_WKUP_IRQHandler,                     /* Ethernet Wakeup through EXTI line Interrupt        */
   CAN2_TX_IRQHandler,                      /* CAN2 TX Interrupt                                  */
   CAN2_RX0_IRQHandler,                     /* CAN2 RX0 Interrupt                                 */
   CAN2_RX1_IRQHandler,                     /* CAN2 RX1 Interrupt                                 */
   CAN2_SCE_IRQHandler,                     /* CAN2 SCE Interrupt                                 */
   OTG_FS_IRQHandler                        /* USB OTG FS global Interrupt                        */
#endif /* STM32F10X_CL */
};

/***************************************************************************************************
END OF FILE
***************************************************************************************************/
